In [1]:
import pandas as pd
import numpy as np

***1. Series*** - *One dimensional Table data*
</br>
***2. DataFrame*** - *Multi dimensional Table Data*

In [3]:
simple_series = pd.Series(np.random.randint(2, 20, size=(8), dtype="int"))
simple_series

0     3
1     8
2    17
3    19
4    14
5     6
6    15
7    10
dtype: int32

In [4]:
simple_series.sum()

92

In [5]:
simple_series.min()

3

In [6]:
simple_series.max()

19

In [7]:
simple_series.std()

5.631543812693436

In [8]:
simple_series.value_counts()

3     1
8     1
17    1
19    1
14    1
6     1
15    1
10    1
dtype: int64

In [9]:
simple_series.index

RangeIndex(start=0, stop=8, step=1)

In [10]:
simple_series.unique()

array([ 3,  8, 17, 19, 14,  6, 15, 10])

In [11]:
simple_series.nunique()

8

In [12]:
simple_series.size

8

In [13]:
print(simple_series.T)
print(simple_series.T.shape)

0     3
1     8
2    17
3    19
4    14
5     6
6    15
7    10
dtype: int32
(8,)

In [14]:
simple_series.shape

(8,)

In [15]:
simple_series.name = "Age"
simple_series

0     3
1     8
2    17
3    19
4    14
5     6
6    15
7    10
Name: Age, dtype: int32

In [16]:
simple_series.ndim

1

In [19]:
simple_series.agg(['min', 'max', 'std', 'var', 'mean'])

min      3.000000
max     19.000000
std      5.631544
var     31.714286
mean    11.500000
Name: Age, dtype: float64

In [ ]:
simple_series.apply(lambda x : x*2)

0    14
1    12
2    26
3    12
4    22
5    18
6    20
7    34
Name: Age, dtype: int64

In [ ]:
def mul(x):
    return x*2

simple_series.apply(mul)

0    14
1    12
2    26
3    12
4    22
5    18
6    20
7    34
Name: Age, dtype: int64

#### Assignment III on 18-12-2022
1. datatime
2. concat two series object
3. convert dtype 
4. filter

`Extra : groupby`

In [43]:
date = pd.Series(pd.date_range('1/1/2023', '2/1/2023', freq="B"))
sales = pd.Series(np.arange(1, 24, 1), name="sales")
sales.shape, date.shape

((23,), (23,))

In [40]:
df = pd.concat([date, sales], axis=1)
df = df.rename(columns={
    0:'Date',
    1:"Sales"
})
df

         Date  Sales
0  2023-01-02      1
1  2023-01-03      2
2  2023-01-04      3
3  2023-01-05      4
4  2023-01-06      5
5  2023-01-09      6
6  2023-01-10      7
7  2023-01-11      8
8  2023-01-12      9
9  2023-01-13     10
10 2023-01-16     11
11 2023-01-17     12
12 2023-01-18     13
13 2023-01-19     14
14 2023-01-20     15
15 2023-01-23     16
16 2023-01-24     17
17 2023-01-25     18
18 2023-01-26     19
19 2023-01-27     20
20 2023-01-30     21
21 2023-01-31     22
22 2023-02-01     23

In [42]:
sales.astype("float")

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      7.0
7      8.0
8      9.0
9     10.0
10    11.0
11    12.0
12    13.0
13    14.0
14    15.0
15    16.0
16    17.0
17    18.0
18    19.0
19    20.0
20    21.0
21    22.0
22    23.0
dtype: float64

In [45]:
sales

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
20    21
21    22
22    23
Name: sales, dtype: int32

In [49]:
df.filter(items=['Date'])

         Date
0  2023-01-02
1  2023-01-03
2  2023-01-04
3  2023-01-05
4  2023-01-06
5  2023-01-09
6  2023-01-10
7  2023-01-11
8  2023-01-12
9  2023-01-13
10 2023-01-16
11 2023-01-17
12 2023-01-18
13 2023-01-19
14 2023-01-20
15 2023-01-23
16 2023-01-24
17 2023-01-25
18 2023-01-26
19 2023-01-27
20 2023-01-30
21 2023-01-31
22 2023-02-01

In [50]:
with_na = pd.Series([0, 2, 5, np.NAN, 6, np.NAN, 2])
with_na

0    0.0
1    2.0
2    5.0
3    NaN
4    6.0
5    NaN
6    2.0
dtype: float64

In [54]:
with_na.bfill()

0    0.0
1    2.0
2    5.0
3    6.0
4    6.0
5    2.0
6    2.0
dtype: float64

#### DataFrame

In [70]:
dataframe = pd.DataFrame({
    "date":pd.date_range('1/1/2023', '2/1/2023', freq="B"),
    "Quantity":np.random.randint(1, 4, size=(23)),
    "Sales":np.abs(np.random.randn(23)*100)
})

In [75]:
dataframe

         date  Quantity       Sales
0  2023-01-02         1   94.794401
1  2023-01-03         3   51.345495
2  2023-01-04         1  143.136149
3  2023-01-05         2  128.344275
4  2023-01-06         1  239.552600
5  2023-01-09         3   95.465448
6  2023-01-10         3   21.438924
7  2023-01-11         3  132.829304
8  2023-01-12         1   39.548300
9  2023-01-13         3  183.153331
10 2023-01-16         2   48.974028
11 2023-01-17         2  184.172780
12 2023-01-18         3   18.242703
13 2023-01-19         1   77.357501
14 2023-01-20         2  190.917202
15 2023-01-23         2   75.102728
16 2023-01-24         2  231.807888
17 2023-01-25         2   23.618583
18 2023-01-26         1   76.841712
19 2023-01-27         2   86.841809
20 2023-01-30         3   24.144140
21 2023-01-31         1   80.517310
22 2023-02-01         1  153.025084

In [76]:
dataframe["Quantity"]

0     1
1     3
2     1
3     2
4     1
5     3
6     3
7     3
8     1
9     3
10    2
11    2
12    3
13    1
14    2
15    2
16    2
17    2
18    1
19    2
20    3
21    1
22    1
Name: Quantity, dtype: int32

In [73]:
type(dataframe['Quantity'])

pandas.core.series.Series

In [78]:
dataframe.head(7)

        date  Quantity       Sales
0 2023-01-02         1   94.794401
1 2023-01-03         3   51.345495
2 2023-01-04         1  143.136149
3 2023-01-05         2  128.344275
4 2023-01-06         1  239.552600
5 2023-01-09         3   95.465448
6 2023-01-10         3   21.438924

In [79]:
dataframe.tail(6)

         date  Quantity       Sales
17 2023-01-25         2   23.618583
18 2023-01-26         1   76.841712
19 2023-01-27         2   86.841809
20 2023-01-30         3   24.144140
21 2023-01-31         1   80.517310
22 2023-02-01         1  153.025084

In [90]:
dataframe.iloc[4:-2, :2]

         date  Quantity
4  2023-01-06         1
5  2023-01-09         3
6  2023-01-10         3
7  2023-01-11         3
8  2023-01-12         1
9  2023-01-13         3
10 2023-01-16         2
11 2023-01-17         2
12 2023-01-18         3
13 2023-01-19         1
14 2023-01-20         2
15 2023-01-23         2
16 2023-01-24         2
17 2023-01-25         2
18 2023-01-26         1
19 2023-01-27         2
20 2023-01-30         3

In [91]:
dataframe.iloc[8:14, :]

         date  Quantity       Sales
8  2023-01-12         1   39.548300
9  2023-01-13         3  183.153331
10 2023-01-16         2   48.974028
11 2023-01-17         2  184.172780
12 2023-01-18         3   18.242703
13 2023-01-19         1   77.357501

In [92]:
dataframe["Quantity"] > 2

0     False
1      True
2     False
3     False
4     False
5      True
6      True
7      True
8     False
9      True
10    False
11    False
12     True
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20     True
21    False
22    False
Name: Quantity, dtype: bool

In [101]:
df = dataframe[:4]
df

        date  Quantity       Sales
0 2023-01-02         1   94.794401
1 2023-01-03         3   51.345495
2 2023-01-04         1  143.136149
3 2023-01-05         2  128.344275

In [100]:
df[[True, False, True, False]]

        date  Quantity       Sales
0 2023-01-02         1   94.794401
2 2023-01-04         1  143.136149

In [102]:
dataframe[dataframe["Quantity"] > 2]

         date  Quantity       Sales
1  2023-01-03         3   51.345495
5  2023-01-09         3   95.465448
6  2023-01-10         3   21.438924
7  2023-01-11         3  132.829304
9  2023-01-13         3  183.153331
12 2023-01-18         3   18.242703
20 2023-01-30         3   24.144140

In [103]:
dataframe[dataframe["Sales"] >= 100]

         date  Quantity       Sales
2  2023-01-04         1  143.136149
3  2023-01-05         2  128.344275
4  2023-01-06         1  239.552600
7  2023-01-11         3  132.829304
9  2023-01-13         3  183.153331
11 2023-01-17         2  184.172780
14 2023-01-20         2  190.917202
16 2023-01-24         2  231.807888
22 2023-02-01         1  153.025084

In [105]:
dataframe[(dataframe["Sales"] > 50) & (dataframe["Quantity"] > 1)]

         date  Quantity       Sales
1  2023-01-03         3   51.345495
3  2023-01-05         2  128.344275
5  2023-01-09         3   95.465448
7  2023-01-11         3  132.829304
9  2023-01-13         3  183.153331
11 2023-01-17         2  184.172780
14 2023-01-20         2  190.917202
15 2023-01-23         2   75.102728
16 2023-01-24         2  231.807888
19 2023-01-27         2   86.841809

In [108]:
dataframe.apply(lambda x:x['Quantity']**2, axis=1)

0     1
1     9
2     1
3     4
4     1
5     9
6     9
7     9
8     1
9     9
10    4
11    4
12    9
13    1
14    4
15    4
16    4
17    4
18    1
19    4
20    9
21    1
22    1
dtype: int64

In [109]:
dataframe["New_column"] = 1

In [114]:
dataframe.rename(
    columns={
        'New_column':"Flag"
    }, inplace=True
)

In [115]:
dataframe

         date  Quantity       Sales  Flag
0  2023-01-02         1   94.794401     1
1  2023-01-03         3   51.345495     1
2  2023-01-04         1  143.136149     1
3  2023-01-05         2  128.344275     1
4  2023-01-06         1  239.552600     1
5  2023-01-09         3   95.465448     1
6  2023-01-10         3   21.438924     1
7  2023-01-11         3  132.829304     1
8  2023-01-12         1   39.548300     1
9  2023-01-13         3  183.153331     1
10 2023-01-16         2   48.974028     1
11 2023-01-17         2  184.172780     1
12 2023-01-18         3   18.242703     1
13 2023-01-19         1   77.357501     1
14 2023-01-20         2  190.917202     1
15 2023-01-23         2   75.102728     1
16 2023-01-24         2  231.807888     1
17 2023-01-25         2   23.618583     1
18 2023-01-26         1   76.841712     1
19 2023-01-27         2   86.841809     1
20 2023-01-30         3   24.144140     1
21 2023-01-31         1   80.517310     1
22 2023-02-01         1  153.025084     1

#### To Save a DataFrame object

In [117]:
dataframe.to_csv("dataframe.csv", index=False)

#### load a dataset in Pandas

In [124]:
Amazon_df = pd.read_csv("./Amazon Sale Report.csv",index_col="index")

C:\Users\Navazdeen S\AppData\Local\Temp\ipykernel_12884\2736423433.py:1: DtypeWarning: Columns (23) have mixed types. Specify dtype option on import or set low_memory=False.
  Amazon_df = pd.read_csv("./Amazon Sale Report.csv",index_col="index")

In [126]:
Amazon_df.head()

,Order ID,Date,Status,Fulfilment,Sales Channel,ship-service-level,Style,SKU,Category,Size,...,currency,Amount,ship-city,ship-state,ship-postal-code,ship-country,promotion-ids,B2B,fulfilled-by,Unnamed: 22
index,,,,,,,,,,,,,,,,,,,,,
0,405-8078784-5731545,04-30-22,Cancelled,Merchant,Amazon.in,Standard,SET389,SET389-KR-NP-S,Set,S,...,INR,647.62,MUMBAI,MAHARASHTRA,400081.0,IN,NaN,False,Easy Ship,NaN
1,171-9198151-1101146,04-30-22,Shipped - Delivered to Buyer,Merchant,Amazon.in,Standard,JNE3781,JNE3781-KR-XXXL,kurta,3XL,...,INR,406.00,BENGALURU,KARNATAKA,560085.0,IN,Amazon PLCC Free-Financing Universal Merchant ...,False,Easy Ship,NaN
2,404-0687676-7273146,04-30-22,Shipped,Amazon,Amazon.in,Expedited,JNE3371,JNE3371-KR-XL,kurta,XL,...,INR,329.00,NAVI MUMBAI,MAHARASHTRA,410210.0,IN,IN Core Free Shipping 2015/04/08 23-48-5-108,True,NaN,NaN
3,403-9615377-8133951,04-30-22,Cancelled,Merchant,Amazon.in,Standard,J0341,J0341-DR-L,Western Dress,L,...,INR,753.33,PUDUCHERRY,PUDUCHERRY,605008.0,IN,NaN,False,Easy Ship,NaN
4,407-1069790-7240320,04-30-22,Shipped,Amazon,Amazon.in,Expedited,JNE3671,JNE3671-TU-XXXL,Top,3XL,...,INR,574.00,CHENNAI,TAMIL NADU,600073.0,IN,NaN,False,NaN,NaN

In [127]:
Amazon_df.describe()

                 Qty         Amount  ship-postal-code
count  128975.000000  121180.000000     128942.000000
mean        0.904431     648.561465     463966.236509
std         0.313354     281.211687     191476.764941
min         0.000000       0.000000     110001.000000
25%         1.000000     449.000000     382421.000000
50%         1.000000     605.000000     500033.000000
75%         1.000000     788.000000     600024.000000
max        15.000000    5584.000000     989898.000000

In [128]:
Amazon_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 128975 entries, 0 to 128974
Data columns (total 23 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   Order ID            128975 non-null  object
 1   Date                128975 non-null  object
 2   Status              128975 non-null  object
 3   Fulfilment          128975 non-null  object
 4   Sales Channel       128975 non-null  object
 5   ship-service-level  128975 non-null  object
 6   Style               128975 non-null  object
 7   SKU                 128975 non-null  object
 8   Category            128975 non-null  object
 9   Size                128975 non-null  object
 10  ASIN                128975 non-null  object
 11  Courier Status      122103 non-null  object
 12  Qty                 128975 non-null  int64
 13  currency            121180 non-null  object
 14  Amount              121180 non-null  float64
 15  ship-city           128942 non-null  object
 16  ship-state          128942 non-null  object
 17  ship-postal-code    128942 non-null  float64
 18  ship-country        128942 non-null  object
 19  promotion-ids       79822 non-null   object
 20  B2B                 128975 non-null  bool
 21  fulfilled-by        39277 non-null   object
 22  Unnamed: 22         79925 non-null   object
dtypes: bool(1), float64(2), int64(1), object(19)
memory usage: 22.8+ MB

### Collect on Insight from Amazon Sales Report datasets

<a href="https://www.kaggle.com/datasets/thedevastator/unlock-profits-with-e-commerce-sales-data?resource=download">dataset link</a>